import { ECourseCategory, ICourse } from "@/types/course";
import { EEmployee } from "@/types/teacher";

export const courses: ICourse[] = [
  {
    id: 1,
    category: ECourseCategory.PROGRAMMING,
    title: "Програмирање за Деца",
    lessons: 64,
    teacher: EEmployee.HRISTINA_TRAJCEVSKA,
    price: 1800,
    minAge: 7,
    maxAge: 10,
    image_url: "/assets/codelab/images/1.svg",
    duration: 8,
    video_url: "/assets/codelab/videos/video_scratch.mp4",
    description:
      "Програмата е наменета за деца од 7 до 10 години кои сакаат да ги откријат основите на компјутерската технологија и да го направат првиот чекор во светот на програмирањето. Низ игра, визуелни задачи и креативни проекти, децата учат да размислуваат логички и да ги претвораат своите идеи во мали интерактивни игри и анимации.",
    whyChooseCourse: [
      "Лесен и забавен почеток во програмирањето за деца",
      "Развива креативност, логика и самодоверба",
      "Проекти кои децата ги создаваат самостојно: игри, анимации, приказни",
      "Настава преку игра и визуелни примери · идеална за оваа возраст",
      "Обука со искусни инструктори кои работат со деца",
    ],
    courseContents: [
      "Запознавање со компјутер и неговите основни компоненти",
      "Основни Windows функции и дигитална писменост",
      "Креативно цртање и уредување со Paint",
      "Вовед во Scratch · визуелно програмирање",
      "Создавање карактери и анимации во Scratch",
      "Scratch логички блокови: услови, циклуси и настани",
      "Креирање интерактивни приказни и мини игри",
      "Креирање на сопствени игри со задачи и предизвици",
      "Тестирање, отстранување грешки и подобрување на игри",
      "Микробит програмирање во Scratch и контрола на сензори",
      "Контрола преку веб-камера · motion гестикулации во Scratch",
      "Придвижување на физички уреди и роботи преку Scratch",
      "Тимска работа и презентирање сопствени проекти",
    ],
  },
  {
    id: 2,
    category: ECourseCategory.PROGRAMMING,
    title: "Основи на Програмирање",
    lessons: 64,
    teacher: EEmployee.GORAN_BLAZHEVSKI,
    price: 2000,
    minAge: 11,
    maxAge: 14,
    image_url: "/assets/codelab/images/2.svg",
    video_url: "/assets/codelab/videos/video_C.mp4",
    duration: 8,

    description:
      "  Програмата е специјално дизајнирана за деца од 11 до 14 години кои сакаат да го направат својот прв сериозен чекор во светот на технологијата и програмирањето. Низ практични вежби и интересни проекти, учениците ќе се стекнат со цврсти основи во дигитална писменост, логичко размислување и креативно решавање проблеми — вештини кои се клучни за идната професија во ИТ.",

    courseContents: [
      "Запознавање со компјутер и неговите основни компоненти",
      "Основни Windows функции и дигитална писменост",
      "Microsoft Office (Word, PowerPoint, Excel)",
      "Програмирање во C – структурно програмирање и логика",
      "Програмирање во C++ – објектно-ориентирано програмирање",
      "Програмирање во Python – практични задачи и мини проекти",
      "Работа со Micro:bit уреди и сензори",
      "Motion контрола преку веб-камера",
      "Запознавање со Вештачка Интелигенција (AI)",
    ],

    whyChooseCourse: ["Развива логичко размислување и решавање проблеми", "Практични дигитални вештини потребни за иднината", "Креирање сопствени програми, игри и физички уреди", "Забавно и интерактивно учење прилагодено на возраст", "Поддршка од искусни ИТ инструктори и ментори"],
  },
];
