export const instructors = [
  {
    id: "goran-josifovski",
    name: "Горан Јосифовски",
    designation: "Софтверски Инжинер",
    image: "/assets/codelab/team/goran_pic.jpg",
    phone: "+38972123456",
    email: "goran@codelab.com.mk",
    social: [
      {
        url: "https://www.linkedin.com/in/goran-josifovski/",
        icon: "/assets/codelab/social/linkedin-icon.svg",
      },
    ],
    aboutCodelab: "Како тим лидер, ја водам техничката работа и развојот на веб-решенија кои поддржуваат образовни активности за деца, одговоран сум за координација и планирање на проектите и работата на тимот, како и за следење на квалитетот и комуникација со клиентите.",
    aboutMe: "Професионално работам во развој на компјутерски апликации, со фокус на создавање на ефективни и скалабилни софтверски решенија.",
    professionalBackground: "Софтверски инженер со искуство во ИТ индустријата. Стекнато образование на Факултетот за информатика и компјутерски науки ФИНКИ при Универзитетот „Кирил и Методиј“ и дополнителна академија за програмирање. ",
  },
  {
    id: "daniel-pop-ivanov",
    name: "Даниел Поп-Иванов",
    designation: "Економист",
    image: "/assets/codelab/team/daniel_pic.jpg",
    phone: "+38972123459",
    email: "daniel@codelab.com.mk",
    social: [
      {
        url: "https://www.linkedin.com/in/daniel-pop-ivanov-109825234/",
        icon: "/assets/codelab/social/linkedin-icon.svg",
      },
    ],
    aboutCodelab: "Финансии и Планнинг Менеџер, одговорен за управување со финансиските операции, буџетите и планирањето за обезбедување на непречен организациски процес и поддршка на растот на CodeLab.",
    aboutMe: "Се занимавам со сметководство и финансиско планирање, со фокус на обезбедување стабилни и ефикасни финансиски процеси кои ја поддржуваат растечката организација.",
    professionalBackground: "Искуство во финансии со експертиза во сметководство, управување со буџети и финансиска анализа за технолошки ориентирани организации. Стекнато образование на Факултетот за економија при Универзитетот „Кирил и Методиј“.",
  },
  {
    id: "ana-kostovska",
    name: "Ана Костовска",
    designation: "Маркетинг Специјалист",
    image: "/assets/codelab/team/ana_pic.jpg",
    phone: "+38972123460",
    email: "ana@codelab.com.mk",
    social: [
      {
        url: "https://www.linkedin.com/in/kostovskaana/",
        icon: "/assets/codelab/social/linkedin-icon.svg",
      },
    ],
    aboutCodelab: "Во CodeLab работам во областа на маркетингот и комуникациите, со главен фокус на промоција на академијата и нејзините програми за учење.",
    aboutMe:
      "Јас сум креативна и комуникативна личност со интерес кон маркетинг, дигитални медиуми и визуелен дизајн. Ме мотивира можноста преку идеи и стратегии да се создаде позитивна промена и да се допре до вистинската публика. Сакам тимска работа, учење нови работи и изразување на креативноста преку кампањи и содржина што инспирира.",
    professionalBackground:
      "Дипломиран маркетинг специјалист со дополнителна обука во графички дизајн и искуство во визуелна комуникација, брендирање и креативни кампањи. Во CodeLab работам на дигитален маркетинг, развој на стратегии и креирање содржина за зголемување на видливоста на брендот, комбинирајќи аналитички пристап со креативност за ефективни резултати.",
  },
  {
    id: "goran-blazhevski",
    name: "Горан Блажевски",
    designation: "Софтверски Инжинер",
    image: "/assets/codelab/team/goranB_pic.jpg",
    phone: "+38972123457",
    email: "goranb@codelab.com.mk",
    social: [
      {
        url: "https://www.linkedin.com/in/goran-blazeski-41b8221a6/",
        icon: "/assets/codelab/social/linkedin-icon.svg",
      },
    ],
    aboutCodelab: "Како ментор во CodeLab, сум ангажиран на предавање на различни програмски јазици. Мојата главна одговорност е да развивам алгоритамско размислување кај учениците и да им помогнам да стекнат подлабоко разбирање на информатиката.",
    aboutMe: "Се занимавам со ИТ проекти и хобија, покрај програмирањето исто така работам со графички дизајн и UX/UI. Главната мотивација ми е постојаниот личен и професионален развој, како и желбата за стекнување нови знаења.",
    professionalBackground: "Моето формално образование во информатика е стекнато на Факултетот за информатички науки и компјутерско инженерство. Професионалното искуство главно се однесува на програмирање, со посебен фокус на финансиски технологии (FinTech).",
  },
  // {
  //   id: "hristina-trajcevska",
  //   name: "Христина Трајчевска",
  //   designation: "Софтверски Инжинер и ментор",
  //   image: "/assets/images/team/team-1/3.png",
  //   phone: "+38972123458",
  //   email: "hristina@codelab.com.mk",
  //   social: [],
  //   aboutCodelab: "Менторирам студенти на проекти за софтверски развој, помагајќи им да развијат технички вештини и самодоверба во кодирањето.",
  //   aboutMe: "Во CodeLab, обезбедувам насоки за софтверски инженеринг, преглед на код и менторство на проекти.",
  //   professionalBackground: "Специјалист за React и full-stack развој со искуство во колаборативни проекти и создавање висококвалитетни веб-апликации.",
  // },

  // {
  //   id: "tamara-smiljkovska",
  //   name: "Тамара Смилјковска",
  //   designation: "Маркетинг",
  //   image: "/assets/images/team/team-1/6.png",
  //   phone: "+38972123461",
  //   email: "tamara@codelab.com.mk",
  //   social: [],
  //   aboutCodelab: "Придонесувам кон маркетинг стратегијата, кампањите и комуникацијата со студенти и партнери во CodeLab.",
  //   aboutMe: "Во CodeLab, помагам во развој на маркетинг кампањи и управување со комуникацијата со нашата публика.",
  //   professionalBackground: "Искуство во маркетинг стратегии, управување со социјални медиуми и промоција на едукативни содржини.",
  // },
];
